Add new architecture diagram to README
